{
    "title": "Roxette - Look Sharp! (1988)",
    "date": "March 17, 2025",
    "image": "images/roxettelooksharp.jpg",
    "tags": ["Roxette", "Look Sharp!", "pop rock", "1988", "music review"],
    "content": "<h2>Introduction</h2>\
        <p>The <i>Look Sharp!</i> album by Roxette was my first introduction to the music world which I started \
        listening to way back in 2018. I still remember when I first heard their song <strong>Dangerous</strong> \
        on the radio; it stuck in my mind as a memorable song, which I had to search on YouTube and discover more. \
        At the time, I wasn't that fascinated with the music scene, let alone the 1980s music scene of pop and rock. \
        However, this was a first.</p>\
        \
        <p> Roxette is a Swedish duo consisting of Marie Fredricksson and Per Gessle, with Marie as the main vocalist \
        and Per as the songwriter for most of their songs. Other Swedish bands, like ABBA in the 70s, made their mark in the \
        music industry, but Roxette took over the late 80s and early 90s.</p>\
        \
        <p>My first thought of discovering Roxette was lackluster (yeah, my past self wasn't that observant or critical), \
        where there were only a few songs from their album that piqued my interest, such as <strong>The Look</strong>, \
        <strong>Dangerous</strong>, and <strong>Dressed For Success</strong>. These three songs stood out to me at the time \
        for their energetic playstyle and clear-cut vocals from the duo, which complemented each other well like a musical puzzle.</p>\
        \
        <h2>Tracklist</h2>\
        <ol>\
            <li>The Look</li>\
            <li>Dressed For Success</li>\
            <li>Sleeping Single</li>\
            <li>Paint</li>\
            <li>Dance Away</li>\
            <li>Cry</li>\
            <li>Chances</li>\
            <li>Dangerous</li>\
            <li>Half a Woman</li>\
            <li>View from a Hill</li>\
            <li>(I Could Never) Give Up</li>\
            <li>Shadow of a Doubt</li>\
            <li>Listen To Your Heart</li>\
        </ol>\
        \
        <h2>Impressions</h2>\
        <p>At first glance, nothing about the tracklist stood out. Standard song durations, a newsletter-style album cover, \
        and 13 individual songs seemed typical. However, once I listened to a few other songs like <strong>Paint</strong> and \
        <strong>Sleeping Single</strong>, my view changed dramatically. These two songs provided a unique style, with more emphasis \
        on electric synths and the distinct vocals of Marie Fredricksson. <strong>Paint</strong> seemed like a direct contrast to \
        <strong>Dressed For Success</strong>, where Marie's vocals were smooth and velvety rather than sharp, loud, and bold.</p>\
        \
        <p>One song, in particular, left a deep impression on me: <strong>Listen To Your Heart</strong>. When I first played it on my \
        old iPad Air 2, it blew me away with its vocal range and emotional depth. Similar to <strong>Sleeping Single</strong>, \
        Marie's voice was complemented by a melodious piano and synth duo, allowing more emphasis on the vocals with well-placed \
        guitar riffs. This created one of Roxette's most iconic tracks.</p>\
        \
        <p>After <i>Look Sharp!</i>, I ended up exploring more of Roxette’s past and future works, like <strong>Joyride</strong>, \
        <strong>Crash Boom Bang</strong>, and even <strong>Pearls of Passion</strong> (which I'll discuss in a future review). \
        I realized that they were a much bigger presence in the music industry than I initially thought. However, it took me \
        over a year to truly dive into their extensive catalog.</p>\
        \
        <h2>Final Thoughts</h2>\
        <p>This album was the first of many that shaped my journey through music listening and exposed me to the late 80s sound. \
        Even now, seven years later, I still revisit the album to relive that experience and compare it to the other tracks \
        I listen to today.</p>\
        \
        <h3>⭐ Rating: 7/10</h3>"
}
